In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/drug/train.csv')

### Q1. 남성들의 연령대별 (10살씩 구분 0 ~ 9세 10 ~ 19세 ...) Na_to_K값의 평균값을 구해서 데이터 프레임으로 표현하여라

In [52]:
df1 = df.loc[df['Sex'] == 'M'].copy()
df1['Age_Bin'] = df1.loc[:,('Age')]//10*10
df1['Age_Bin2'] = pd.cut(df1['Age'], bins=[9,19,29,39,49,59,69,79], labels=[10,20,30,40,50,60,70], right=False)
df1['Age_Bin3'] = pd.cut(df1['Age'], bins=[10,20,30,40,50,60,70,80], labels=[10,20,30,40,50,60,70], right=True)
# < , <= right=False
# <=, < right=True

In [46]:
pd.DataFrame(df1.groupby('Age_Bin').mean()['Na_to_K'], columns=['Na_to_K'])

           Na_to_K
Age_Bin
10       13.627000
20       18.260769
30       15.244143
40       13.897273
50       14.811273
60       14.284308
70       11.363857

In [47]:
pd.DataFrame(df1.groupby('Age_Bin2').mean()['Na_to_K'], columns=['Na_to_K'])

            Na_to_K
Age_Bin2
10        13.627000
20        18.260769
30        15.244143
40        13.897273
50        14.811273
60        14.284308
70        11.363857

In [53]:
pd.DataFrame(df1.groupby('Age_Bin3').mean()['Na_to_K'], columns=['Na_to_K'])

            Na_to_K
Age_Bin3
10        17.295667
20        16.812583
30        16.082933
40        12.972909
50        14.954917
60        14.293333
70        11.616333

In [55]:
pd.cut(df1['Age'], bins=[10,20,30,40,50,60,70,80], right=True)

1      (20, 30]
2      (30, 40]
3      (10, 20]
4      (70, 80]
6      (20, 30]
         ...
149    (60, 70]
150    (30, 40]
151    (50, 60]
155    (50, 60]
156    (10, 20]
Name: Age, Length: 85, dtype: category
Categories (7, interval[int64]): [(10, 20] < (20, 30] < (30, 40] < (40, 50] < (50, 60] < (60, 70] < (70, 80]]